Revit 2027 API
BuiltInFailures.SketchFailures.EndsNotOnEdge Property
 Ends of an open loop in sketch splitting face do not lie on an edge of the face to split.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId EndsNotOnEdge { get; }
Public Shared ReadOnly Property EndsNotOnEdge As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ EndsNotOnEdge {
	FailureDefinitionId^ get ();
}
static member EndsNotOnEdge : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace